Repository: a0mfares/PrezzaR
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: I am Vendor
ar: أنا بائع

source: I am User
ar: أنا مستخدم

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: confirm pass
ar: تأكيد كلمة المرور

source: Forgot password?
ar: هل نسيت كلمة المرور؟

source: Login
ar: تسجيل الدخول

source: OR
ar: أو

source: Continue with google
ar: تسجيل الدخول باستخدام Google

source: Continue with phone
ar: تسجيل الدخول باستخدام الهاتف

source: Continue with E-Mail
ar: تسجيل الدخول باستخدام البريد الإلكتروني

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: First name
ar: الاسم الأول

source: Last name
ar: الاسم الأخير

source: Phone
ar: رقم الهاتف

# passwordValidaton
source: Passwords must be at least 8 characters:
ar: يجب أن تكون كلمات المرور على الأقل 8 أحرف:

# upLetter
source: 1 uppercase letter (A-Z)
ar: حرف كبير واحد (A-Z)

# loLetter
source: 1 lowercase letter (a-z)
ar: حرف صغير واحد (a-z)

# oneNumber
source: 1 number (0-9)
ar: رقم واحد (0-9)

# onSpecial
source: 1 special character
ar: حرف خاص واحد

# iwantRecive
source: I want to receive the latest offers and updates
ar: أريد تلقي أحدث العروض والتحديثات

source: Create Account
ar: إنشاء حساب

# byCreating
source: By creating an account you Aggree to the
ar: بإنشاء حساب فإنك توافق على

# terms
source: Terms of Use
ar: شروط الاستخدام

# privacy
source: Privacy Policy
ar: سياسة الخصوصية

source: and
ar: و

# setupAccount
source: Set up your account
ar: إعداد حسابك

# resendCode
source: Resend code in:
ar: إعادة إرسال الكود خلال:

source: Confirm
ar: تأكيد

# plsEnterEmail
source: please enter your email
ar: يرجى إدخال البريد الإلكتروني

# plsEnterValidEmail
source: please enter valid email
ar: يرجى إدخال بريد إلكتروني صالح

# plsEnterPass
source: please enter your password
ar: يرجى إدخال كلمة المرور

# plsEnterValidPass
source: please enter valid password
ar: يرجى إدخال كلمة مرور صالحة

# yourPassNotMatch
source: your password not match
ar: كلمات المرور غير متطابقة

# plsEnterFName
source: please enter first name
ar: يرجى إدخال الاسم الأول

# plsEnterLName
source: please enter last name
ar: يرجى إدخال الاسم الأخير

# plsEnterPhone
source: please enter you phone
ar: يرجى إدخال رقم الهاتف

# plsEnterValidPhone
source: please enter valid phone
ar: يرجى إدخال رقم هاتف صالح

# plsActivateEmail
source: please activate your email
ar: يرجى تفعيل بريدك الإلكتروني

source: Verify Email
ar: تأكيد البريد الإلكتروني

# plsActivatePhone
source: Please activate your phone
ar: يرجى تفعيل رقم هاتفك

source: Verify Phone
ar: تأكيد رقم الهاتف

# continueWithPhoneInst
source: Continue with phone number instead
ar: استخدام رقم الهاتف بدلاً من ذلك

# continueWithEmailInst
source: Continue with email address instead
ar: استخدام البريد الإلكتروني بدلاً من ذلك

# enterEmailOrPhone
source: Enter your email address or phone number associated with your account
ar: أدخل البريد الإلكتروني أو رقم الهاتف المرتبط بحسابك

# changePass
source: Change Password
ar: تغيير كلمة المرور

# hiMsg
source: Hey {userName},
ar: مرحباً {userName}،

# goodAfterNon
source: Good Afternoon!
ar: مساء الخير!

# emailOrPass
source: email or pass incorrect
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

source: email not found
ar: البريد الإلكتروني غير موجود

# urIn
source: You Are in
ar: أنت في

# searchCoffe
source: Search Coffee Shops, Restaurants, etc
ar: ابحث عن المقاهي، المطاعم، وغيرها

# shareExp
source: Share Your Experience
ar: شارك تجربتك

# sponser
source: Sponsors
ar: الرعاة

# popularPlaces
source: Popular Places Nearby
ar: الأماكن الشهيرة بالقرب منك

source: Company Details
ar: تفاصيل الشركة

# tellUsAbout
source: Tell us about your business ( your customers will see this information on Prezza app to search and contact you )
ar: أخبرنا عن عملك (سيشاهد العملاء هذه المعلومات على تطبيق بريزا للبحث والتواصل معك)

# urBrandLogo
source: Your brand logo
ar: شعار علامتك التجارية

source: Brand Name
ar: اسم العلامة التجارية

source: BusinessType
ar: نوع النشاط التجاري

# businessDescription
source: Your Business type
ar: وصف النشاط التجاري

source: Branches
ar: الفروع

# role
source: Your Role
ar: دورك

# locations
source: Your locations
ar: مواقعك

# describeBrand
source: Descripe your brand
ar: وصف العلامة التجارية

# roleInCompany
source: Enter Your Role in the company
ar: أدخل دورك في الشركة

# operatingHours
source: Operatin hours
ar: ساعات العمل

# servicesProvided
source: I am providing
ar: الخدمات المقدمة

source: Delivery Only
ar: التوصيل فقط

source: Pickup Only
ar: الاستلام فقط

# deliveryAndPickup
source: Delivery & Pickup
ar: التوصيل والاستلام

# addLocation
source: Add new lcoation
ar: إضافة موقع جديد

source: Address
ar: العنوان

source: landmark
ar: معلم قريب

source: Address Title
ar: عنوان الموقع

# currentLocation
source: Add Your Current Location
ar: إضافة موقعك الحالي

# processingRequest
source: We Are Processing your request
ar: جارٍ معالجة طلبك

# thanksPatience
source: Thanks for your patience
ar: شكراً على صبرك

source: Take Photo
ar: التقاط صورة

source: From Gallery
ar: من المعرض

source: Personal Info
ar: المعلومات الشخصية

source: Business Info
ar: معلومات العمل

source: Settings
ar: الإعدادات

source: Feedback
ar: التقييم

source: Help
ar: المساعدة

source: About
ar: عن التطبيق

source: Logout
ar: تسجيل الخروج

source: My Account
ar: حسابي

source: Promotions
ar: العروض

source: App Updates
ar: تحديثات التطبيق

source: Language Preference
ar: تفضيل اللغة

source: Theme Preference
ar: تفضيل السمة

# overallRating
source: Overall App Rating
ar: تقييم التطبيق العام

# customerOpinions
source: What our customers think of us
ar: آراء العملاء عنا

# leaveFeedback
source: Leave Your Feedback
ar: اترك تقييمك

source: Common Issues
ar: المشاكل الشائعة

# describeIssue
source: Descripe your issue
ar: وصف مشكلتك

# furtherHelp
source: Need Further Help?
ar: تحتاج إلى مزيد من المساعدة؟

source: Rate us
ar: قيّمنا

# sendFeedback
source: Leave Us feedback
ar: اترك تقييمك

source: Send
ar: إرسال

source: Orders
ar: الطلبات

# runningOrders
source: Running
ar: الطلبات الجارية

# pendingOrders
source: Pending
ar: الطلبات المعلقة

# orderDetails
source: Details
ar: تفاصيل الطلب

source: Done
ar: تم

# orderId
source: ID:{id}
ar: الرقم التعريفي: {id}

source: Total Revenue
ar: إجمالي الإيرادات

source: Daily
ar: يومي

source: Monthly
ar: شهري

source: Yearly
ar: سنوي

# reviews
source: Reivews
ar: التقييمات

source: See All Reviews
ar: عرض جميع التقييمات

source: Most Ordered This Week
ar: الأكثر طلباً هذا الأسبوع

source: Food List
ar: قائمة الطعام

# total
source: Total: {price}
ar: الإجمالي: {price}

source: Reject
ar: رفض

source: Accept
ar: قبول

source: Arrives In:
ar: سيصل خلال:

source: Special Request
ar: طلب خاص

source: Size
ar: الحجم

source: Extras
ar: الإضافات

source: Side Items
ar: الأطباق الجانبية

# orderAccepted
source: You Acceepted the order
ar: تم قبول الطلب

# tellClient
source: Would you like to tell your client any thing
ar: هل ترغب في إخبار العميل بشيء؟

source: Write here
ar: اكتب هنا

source: Cancel
ar: إلغاء

# orderRejected
source: You rejected the order
ar: تم رفض الطلب

# clientReason
source: tell you client the reason
ar: أخبر العميل بسبب الرفض

source: Notifications
ar: الإشعارات

source: New Items
ar: عناصر جديدة

source: Item Name
ar: اسم العنصر

source: Upload Photo
ar: رفع صورة

source: Price
ar: السعر

# chooseCategory
source: Choose From Categories
ar: اختر من الفئات

source: Sizes
ar: الأحجام

source: Preparing time
ar: وقت التحضير

# description
source: Discription
ar: الوصف

source: Apply
ar: تطبيق

source: Item added
ar: تم إضافة العنصر

source: Ok
ar: موافق

# chooseDrink
source: Choose your soft drink
ar: اختر مشروبك الغازي

# chooseYourSideItem
source: Choose your {question}: (Required)
ar: اختر {question} الخاص بك: (مطلوب)

source: Add Item
ar: إضافة عنصر

source: Item Details
ar: تفاصيل العنصر

source: Add size
ar: إضافة حجم

source: Question
ar: سؤال

source: Add option
ar: إضافة خيار

source: Extra Charge
ar: رسوم إضافية

# nameCategory
source: Name your new Category
ar: سمِّ الفئة الجديدة

source: Add Category
ar: إضافة فئة

# newPhoneNumber
source: Enter your new number
ar: أدخل رقمك الجديد

# smsOtp
source: We will sendd you an SMS with OTP code
ar: سنرسل لك رمز OTP برسالة قصيرة

source: Edit Phone Number
ar: تعديل رقم الهاتف

source: Edit Email Address
ar: تعديل البريد الإلكتروني

# newEmail
source: Enter your new mail
ar: أدخل بريدك الإلكتروني الجديد

# emailOtp
source: we will sne you an email with OTP code
ar: سنرسل لك رمز OTP بالبريد الإلكتروني

source: Delivery Addresses
ar: عناوين التوصيل

source: Add New Address
ar: إضافة عنوان جديد

source: Your Cars
ar: سياراتك

source: Add New Car
ar: إضافة سيارة جديدة

source: Vehicle Brand
ar: ماركة السيارة

source: Vehicle Model
ar: طراز السيارة

source: Vehicle Color
ar: لون السيارة

source: Vehicle Type
ar: نوع السيارة

source: License plate
ar: رقم اللوحة

source: Add
ar: إضافة

source: Payment Methods
ar: طرق الدفع

source: Add Payment Method
ar: إضافة وسيلة دفع

source: Card Holder Name
ar: اسم حامل البطاقة

source: Enter Your Name
ar: أدخل اسمك

source: Card Number
ar: رقم البطاقة

source: Expiry Date
ar: تاريخ الانتهاء

source: CVV
ar: الرمز الأمني

# orderNotifications
source: Notifications about placed, ongoing, and delivered orders.
ar: إشعارات حول الطلبات المقدمة، الجارية، والمسلّمة.

# discountNotifications
source: Notifications about discounts, special offers, and seasonal promotions.
ar: إشعارات حول الخصومات، العروض الخاصة، والعروض الموسمية.

# importantNotifications
source: Notifications about important app changes or new updates.
ar: إشعارات حول تغييرات التطبيق الهامة أو التحديثات الجديدة.

# allNotifications
source: All
ar: الكل

source: News Feed
ar: آخر الأخبار

source: Follow
ar: متابعة

source: UnFollow
ar: إلغاء المتابعة

source: Make Order
ar: تقديم طلب

# bookingSuccessful
source: Booking Done successfully
ar: تم الحجز بنجاح

source: Booking Canceled
ar: تم إلغاء الحجز

source: Drop Order
ar: إلغاء الطلب

source: Invite Friends
ar: دعوة الأصدقاء

# inviteEarnPoints
source: Invite your firends and earn {points} pts
ar: ادعُ أصدقائك واكسب {points} نقطة

# invitationLink
source: Send your friends your personal invitation link or code
ar: أرسل رابط الدعوة أو الكود الخاص بك

# freePoints
source: Enjoy your free 3,000 pts
ar: استمتع بـ 3000 نقطة مجانية

# shareCode
source: Share My Code
ar: شارك الكود الخاص بي

source: Home
ar: الرئيسية

source: Booking
ar: الحجز

# filterSearch
source: Filter your search
ar: تصفية البحث

source: Distance
ar: المسافة

source: Estimated Time
ar: الوقت المتوقع

# rating
source: {count} Results
ar: {count} نتيجة

source: Cuisines
ar: المطابخ

source: Sort by
ar: فرز حسب

# sortAZ
source: A-Z
ar: أ-ي

# sortDistance
source: Distance From Center
ar: المسافة من المركز

# sortHighToLow
source: Rating (High To Low)
ar: التقييم (من الأعلى إلى الأقل)

# sortLowToHigh
source: Rating (Low To High)
ar: التقييم (من الأقل إلى الأعلى)

source: Sort
ar: فرز

# allRestaurants
source: All resaurants
ar: جميع المطاعم

source: View All
ar: عرض الكل

source: Pickup
ar: استلام

source: Delivery
ar: توصيل

source: Favorites
ar: المفضلة

# deliveringTo
source: Delivering to {address}
ar: التوصيل إلى {address}

# expectedPreparingTime
source: Expected preparing time: {value}
ar: الوقت المتوقع للتحضير: {value}

source: Often ordered with
ar: غالبًا ما يُطلب مع

# specialRequestCart
source: Any Special Request
ar: أي طلب خاص

source: Add To Cart
ar: إضافة إلى السلة

# cartEmpty
source: Your cart is empty
ar: سلتك فارغة

# trending
source: Check out What's trending
ar: اطلع على الأكثر رواجاً

source: Discover Products
ar: استكشف المنتجات

source: Clear Cart
ar: إفراغ السلة

source: Cart
ar: السلة

# addDiscount
source: Get Discount
ar: احصل على خصم

# promoCode
source: Enter Your Promo Code
ar: أدخل كود الخصم

source: Breakdown
ar: تفصيل

source: Add Items
ar: إضافة عناصر

source: Place Order
ar: تأكيد الطلب

source: Check Out
ar: الدفع

source: Pay with
ar: الدفع باستخدام

# proceed
source: Procceed
ar: إتمام العملية

# scheduleOrder
source: Schedule Your Order
ar: جدولة الطلب

source: Track Order
ar: تتبع الطلب

source: Ongoing
ar: جارية

source: History
ar: السجل

source: Re-Order
ar: إعادة الطلب

source: Remove
ar: إزالة

# orderPlaced
source: Your order has been placed
ar: تم تقديم طلبك

# orderPreparing
source: [{storeName}] is preparing your order
ar: {storeName} يقوم بتحضير طلبك

# orderOutForDelivery
source: Your order is out for delivery
ar: طلبك في الطريق للتوصيل

# gpsError
source: No GPS connection
ar: لا يوجد اتصال بـ GPS

# gpsSettings
source: please check for location
ar: يرجى التحقق من إعدادات الموقع

source: Go to GPS settings
ar: اذهب إلى إعدادات GPS

source: no Credit cards
ar: لا توجد بطاقات ائتمان

# addCreditCardPrompt
source: Please add credit card to your account
ar: يرجى إضافة بطاقة ائتمان إلى حسابك

# addCreditCard
source: Add a Credit Card
ar: إضافة بطاقة ائتمان

# noNotifications
source: You dont't have new notification yet
ar: لا توجد إشعارات جديدة

source: Create Post
ar: إنشاء منشور

source: Next
ar: التالي

# shareExperience
source: Share your experience
ar: شارك تجربتك

source: Add photos
ar: إضافة صور

source: Tag Vendor
ar: وضع علامة على البائع

source: Mention Item
ar: اذكر العنصر

source: Suggestions
ar: اقتراحات

source: Profile
ar: الملف الشخصي

source: Followers
ar: المتابعون

source: Following
ar: تتابع

source: Feed
ar: الخلاصة

source: Saved
ar: المحفوظات

source: Save
ar: حفظ

source: Remove Follower
ar: إزالة متابع

source: Likes
ar: الإعجابات

source: Comments
ar: التعليقات

# urKnownName
source: Your known name
ar: اسمك المعروف

source: From
ar: من

source: TO
ar: إلى

# branchLocation
source: Branches Location
ar: مواقع الفروع

source: More
ar: المزيد

source: Your Referral Code
ar: رمز الدعوه الخاص بك

source: Enjoy !
ar: استمتع

# myLikeAdd
source: May you like to add
ar: ربما ترغب في الإضافة

source: Order Update
ar: تحديثات الطلبات

# orderUpdateSubTitle
source: notifications for when the order is placed, in progress, and delivered.
ar: إشعارات عند وضع الطلب، أثناء التجهيز، وعند التسليم.

# promotionsSubTitle
source: notifications for discounts, special deals, and seasonal offers.
ar: إشعارات عن الخصومات، العروض الخاصة، والعروض الموسمية.

# appUpdatesSubTitle
source: Notifications regarding important app changes, new features, or updates.
ar: إشعارات تتعلق بالتغييرات المهمة في التطبيق، الميزات الجديدة، أو التحديثات.

source: Apple pay
ar: الدفع با ابل

source: Cash
ar: نقدًا

# credit
source: Credit Card
ar: بطاقة ائتمان

# chooseCar
source: choose your car
ar: اختر السيارة

# youCanCancel
source: You can cancel it within {time} mins max
ar: يمكنك إلغاؤه خلال {time} دقيقة كحد أقصى

# youCantCancel
source: Order Cannot be cancelled it is being prepared now
ar: لا يمكن إلغاء الطلب لأنه يتم تحضيره الآن

source: Categories
ar: الفئات

# km
source: {distance} km
ar: {distance} كم

# clickShowItems
source: Tap here to show your items
ar: اضغط هنا لعرض العناصر

# clickAgain
source: Tap Again to Add New Item
ar: اضغط مرة أخرى لإضافة عنصر جديد

# clientsCanBook
source: Clients can book appointments with me
ar: يمكن للعملاء حجز مواعيد معي

# brandNamePrompt
source: Please enter brand name
ar: يرجى إدخال اسم العلامة التجارية

# branchesCountPrompt
source: Please enter count of branches
ar: يرجى إدخال عدد الفروع

# businessTypePrompt
source: Please select business type
ar: يرجى اختيار نوع العمل

# rolePrompt
source: Please enter your role
ar: يرجى إدخال دورك

# descriptionPrompt
source: Please enter description
ar: يرجى إدخال الوصف

# openHoursPrompt
source: Please select open hours
ar: يرجى اختيار ساعات العمل

# closeHoursPrompt
source: Please select close hours
ar: يرجى اختيار ساعات الإغلاق

# providingPrompt
source: Please select providing
ar: يرجى اختيار الخدمات المقدمة

source: Bank Name
ar: اسم البنك

source: Side item name
ar: اسم العنصر الجانبي

source: extra name
ar: اسم الإضافة

source: Not set
ar: لم يتم تعين

source: Delete Product
ar: حذف المنتج

# areUSure
source: Are you sure delete this product
ar: هل انت متأكد من حذف هذا النتج

source: Deleted Product
ar: تم حذف المنتج

# productDeletedSuccess
source: Product deleted successfully
ar: تم حذف المنتج بنجاح

source: Required field
ar: حقل مطلوب

# waitingWeAre
source: Please wait, we are making magic
ar: من فضلك انتظر، نحن نصنع السحر.

# viewCard
source: View Your Card
ar: عرض بطاقتك

# plsAuth
source: Please Auth to view you card
ar: يرجى التوثيق لعرض بطاقتك

# useBiometrics
source: Use biometrics to show card?
ar: هل ترغب في استخدام بيانات التعريف البيومترية لعرض البطاقة؟

# locationErrorPerm
source: Location permissions are permanently denied, we cannot request permissions.
ar: لقد تم رفض أذونات الموقع بشكل دائم، ولا يمكننا طلب الأذونات.

# areUSureDeleteLocation
source: Are you sure delete this location
ar: هل أنت متأكد من حذف هذا الموقع؟

source: Delete location
ar: حذف الموقع

# areUSureDeleteBranche
source: Are you sure delete this branche
ar: هل أنت متأكد من حذف هذا الفرع؟

source: Delete branche
ar: حذف الفرع

# areUSureDeleteCar
source: Are you sure delete this car
ar: هل أنت متأكد من حذف هذه السيارة؟

source: Delete car
ar: حذف السيارة

source: Enter valide date
ar: ادخل تاريخ صالح

# enterValideCard
source: Enter valide card details
ar: ادخل بيانات بطاقة صالحه

# areUSureDeleteCard
source: Are you sure delete this card
ar: هل أنت متأكد من حذف هذه البطاقة

source: Delete card
ar: حذف البطاقة

source: Username
ar: اسم المستخدم

source: Enter Valide Data
ar: ادخل بيانات صالحه

# noFav
source: No Favourites Yet
ar: لا يوجد لديك مفضلة

source: Required
ar: مطلوب

source: Select order type
ar: اختر نوع الطلب

# phoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# chooseDeliveryLoction
source: Choose delivery location
ar: اختر موقع التوصيل

# paymentRequired
source: Payment method is required
ar: الدفع مطلوب

# addressRequired
source: Address is required
ar: العنوان مطلوب

# wholeWeak
source: 24/7 Service
ar: خدمة 24/7

source: Open now
ar: مفتوح الآن

# plsCompleteSetup
source: please complete signup profile
ar: يرجى إكمال ملف التسجيل

source: Complete
ar: إكمال

# allSideItemRequired
source: All side items required
ar: جميع العناصر الجانبيه مطلوبه

# pleaseSelectSize
source: please select size first
ar: رجائ حدد الحجم اولا

source: Users
ar: المستخدمين

# noSavedPosts
source: No Saved Posts yet!
ar: لا يوجد منشورات الان!

# noPosts
source: You don't havae any posts yet!
ar: ليس لديك اي منشورات حاليا!

source: Post Saved
ar: تم الحفظ

# noSponsers
source: No Sponsers avaialable
ar: لا تتوفر اعلانات

source: Replys
ar: الردود

source: Reply comment
ar: الرد علي تعليق

source: Add comment
ar: اضف تعليق

source: Delete comment
ar: حذف التعليق

source: Delete Reply
ar: حذف الرد

# noComment
source: No comments
ar: لا يوجد تعليقات

source: Skip
ar: تخطي

# letsStarted
source: Let`s Get Started
ar: لنبدأ

source: Welcome
ar: مرحبًا

# welcomeTitle
source: we're glad that that you are here
ar: نحن سعداء بوجودك هنا

source: Order Ahead
ar: اطلب مسبقًا

# orderAheadTitle
source: Order Any thing now and pick it up whenever you want !
ar: اطلب أي شيء الآن واستلمه متى شئت!

# bookTable
source: Book your Table
ar: احجز طاولتك

# bookTableTitle
source: Book your place and be ready for busy days
ar: احجز مكانك واستعد للأيام المزدحمة

# allFav
source: All Your Favorite Places
ar: جميع أماكنك المفضلة

# allFavTitle
source: From Productive Families, Restaurants, Coffee Shops and even Hotels !
ar: من الأسر المنتجة، المطاعم، المقاهي، وحتى الفنادق!

source: Success update
ar: تم التحديث بنجاح

# oldPass
source: Old password
ar: كلمة المرور القديمة

# areSureLogout
source: Are you sure logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# areSureExitProduct
source: Are you sure you want to exit? The current data will be erased and will not be saved.
ar: هل أنت متأكد أنك تريد الخروج؟ سيتم مسح البيانات الحالية ولن يتم حفظها.

# caughtUp
source: You`re all caught up!
ar: لقد اطلعت على كل شيء!

# plsSelectImg
source: Please Select Image
ar: يرجى اختيار صورة

# youCanScroll
source: You can scroll up or down to explore more side items and you can press to show items
ar: يمكنك التمرير لأعلى أو لأسفل لاستكشاف المزيد من العناصر الجانبية ويمكنك الضغط لعرض العناصر

# plsSelectCategory
source: Please select category
ar: يرجى اختيار الفئة

# incorectPass
source: Inccorect password
ar: كلمة المرور غير صحيحة

source: No Places
ar: لا توجد أماكن

# selectLocationNear
source: Select location to see nearby places
ar: حدد الموقع لرؤية الأماكن القريبة

# tabHereToChangeLocation
source: Tab here to change your location if location not added the nearby places not shown.
ar: اضغط هنا لتغيير موقعك، إذا لم تتم إضافة الموقع فلن تظهر الأماكن القريبة.

source: See More
ar: عرض المزيد

# noResautrants
source: No Resaurants
ar: لا يوجد مطاعم

# ratingTitle
source: Rating
ar: التقييم

# passwordIsRequired
source: Password is required to update personal info
ar: كلمة المرور مطلوبة

source: Any Special Request?
ar: أي طلبات خاصة ؟

# searchITem
source: Search Items
ar: البحث عن العناصر

# addPhoneNum
source: Add Phone Number
ar: إضافة رقم هاتف

# failedTransaction
source: failed to complete transaction
ar: حدث خأ اثناء اكمال العملية

# arrivalTimeError
source: Arrival time must be more than 3 minutes from now
ar: وقت الوصول يجب ان يكون اكثر من ثلاث دقائق

source: Retry
ar: إعادة المحاولة

source: Number of Seats
ar: عدد المقاعد

source: Enter number of seats
ar: أدخل عدد المقاعد

source: Booking Date
ar: تاريخ الحجز

source: Select Date
ar: اختر التاريخ

# numberOfSeatsRequired
source: Number of seats is required
ar: عدد المقاعد مطلوب

# bookingDateRequired
source: Booking date is required
ar: تاريخ الحجز مطلوب

# selectBranch
source: Please select a branch
ar: الرجاء اختيار الفرع

source: Complete setup
ar: أكمل الإعداد

source: User ID not found
ar: لم يتم العثور على معرف المستخدم

source: Select Make
ar: اختر الماركة

source: Select Model
ar: اختر الموديل

# carAddedSuccess
source: Car added successfully
ar: تمت إضافة السيارة بنجاح

# carUpdatedSuccess
source: Car updated successfully
ar: تم تحديث السيارة بنجاح

# carDeletedSuccess
source: Car deleted successfully
ar: تم حذف السيارة بنجاح

# fillAllCarFields
source: Please fill all fields and select an image
ar: يرجى ملء جميع الحقول واختيار صورة

# cartIdEmpty
source: Cart ID is empty
ar: معرف السلة فارغ

# missingRequiredParams
source: Missing required parameters
ar: معلمات مطلوبة مفقودة

# itemUuidEmpty
source: Item UUID is empty
ar: معرف العنصر فارغ

# cartClearedSuccess
source: Cart cleared successfully
ar: تم إفراغ السلة بنجاح

# itemAddedSuccess
source: Item added to cart successfully
ar: تم إضافة العنصر إلى السلة بنجاح

# itemRemovedSuccess
source: Item removed from cart successfully
ar: تم إزالة العنصر من السلة بنجاح

# itemUpdatedSuccess
source: Item quantity updated successfully
ar: تم تحديث كمية العنصر بنجاح

# couponAddedSuccess
source: Coupon applied successfully
ar: تم تطبيق الكوبون بنجاح

# couponRemovedSuccess
source: Coupon removed successfully
ar: تم إزالة الكوبون بنجاح

# cartClosedSuccess
source: Cart closed successfully
ar: تم إغلاق السلة بنجاح

# failureGetUserCart
source: Failed to get user cart
ar: فشل في الحصول على سلة المستخدم

# failureGetCartDetails
source: Failed to get cart details
ar: فشل في الحصول على تفاصيل السلة

# failureClearCart
source: Failed to clear cart
ar: فشل في إفراغ السلة

# failureGetPreparingTime
source: Failed to get preparing time
ar: فشل في الحصول على وقت التحضير

# failureAddItem
source: Failed to add item to cart
ar: فشل في إضافة العنصر إلى السلة

# failureRemoveItem
source: Failed to remove item from cart
ar: فشل في إزالة العنصر من السلة

# failureUpdateItem
source: Failed to update item quantity
ar: فشل في تحديث كمية العنصر

# failureGetOftenProductCart
source: Failed to get often ordered products
ar: فشل في الحصول على المنتجات المطلوبة بشكل متكرر
