Repository: a0mfares/PrezzaR
Catalog: lib/l10n/intl_*.arb
Languages: ar

# failureAddCoupon
source: Failed to apply coupon
ar: فشل في تطبيق الكوبون

# failureCloseCart
source: Failed to close cart
ar: فشل في إغلاق السلة

# failureGetCategories
source: Failed to get categories
ar: فشل في الحصول على الفئات

# failureGetSponsors
source: Failed to get sponsors
ar: فشل في الحصول على الرعاة

source: No sponsors available
ar: لا توجد رعاة متاحة

# categoryLoadingError
source: Error loading categories
ar: خطأ في تحميل الفئات

# sponsorsLoadingError
source: Error loading sponsors
ar: خطأ في تحميل الرعاة

source: Already in favorites
ar: موجود بالفعل في المفضلة

source: Vendor not in favorites
ar: البائع ليس في المفضلة

source: Added to favorites
ar: تمت الإضافة إلى المفضلة

source: Removed from favorites
ar: تمت الإزالة من المفضلة

source: Failed to load favorites
ar: فشل في تحميل المفضلة

# vendorsInFavorites
source: {count} {count, plural, =1{vendor} other{vendors}} in favorites
ar: {count} {count, plural, =1{بائع} other{بائعين}} في المفضلة

source: Error loading favorites
ar: خطأ في تحميل المفضلة

source: No favorites found
ar: لم يتم العثور على مفضلات

source: Refresh favorites
ar: تحديث المفضلة

source: Failed to load business details
ar: فشل في تحميل تفاصيل العمل

source: Error
ar: خطأ

source: Delete account
ar: حذف الحساب

source: Are you sure?
ar: هل أنت متأكد؟

# tutorialSkip
source: SKIP
ar: تخطي

# clickToShowItems
source: Click here to show your items
ar: اضغط هنا لعرض العناصر

# clickToAddNewItem
source: Click again to add a new item
ar: اضغط مرة أخرى لإضافة عنصر جديد

source: Average Rating
ar: متوسط التقييم

source: Total Reviews
ar: إجمالي التقييمات

source: Vendor Balance
ar: رصيد البائع

source: No orders available
ar: لا توجد طلبات متاحة

source: No products available
ar: لا توجد منتجات متاحة

source: No notifications available
ar: لا توجد إشعارات متاحة

source: Business Details
ar: تفاصيل العمل

source: Order Status
ar: حالة الطلب

source: Revenue
ar: الإيرادات

source: Customer Reviews
ar: تقييمات العملاء

source: Popular Products
ar: المنتجات الشائعة

source: Failed to load reviews
ar: فشل في تحميل التقييمات

source: Failed to load common issues
ar: فشل في تحميل المشاكل الشائعة

source: Failed to load FAQ
ar: فشل في تحميل الأسئلة الشائعة

source: Failed to load social platforms
ar: فشل في تحميل منصات التواصل الاجتماعي

source: Failed to load download platforms
ar: فشل في تحميل منصات التنزيل

source: Failed to add review
ar: فشل في إضافة التقييم

source: Review added successfully
ar: تم إضافة التقييم بنجاح

source: Search issues
ar: البحث عن المشاكل

source: No reviews found
ar: لم يتم العثور على تقييمات

source: No common issues found
ar: لم يتم العثور على مشاكل شائعة

source: No FAQ found
ar: لم يتم العثور على أسئلة شائعة

source: No social platforms found
ar: لم يتم العثور على منصات تواصل اجتماعي

source: No download platforms found
ar: لم يتم العثور على منصات تنزيل

source: Success added
ar: تمت الإضافة بنجاح

source: Success updated
ar: تم التحديث بنجاح

source: Success deleted
ar: تم الحذف بنجاح

# locationServicesDisabled
source: Location services are disabled
ar: خدمات الموقع معطلة

# locationPermissionsDenied
source: Location permissions are denied
ar: تم رفض أذونات الموقع

# locationPermissionsDeniedForever
source: Location permissions are permanently denied
ar: تم رفض أذونات الموقع بشكل دائم

# houseNumberHint
source: House Number / Flat / Block No.
ar: رقم المنزل / الشقة / المبنى

# landmarkHint
source: e.g. Near ABC School
ar: مثلاً بالقرب من مدرسة ABC

# searchForLocation
source: Search for a building, street or ...
ar: ابحث عن مبنى أو شارع أو ...

source: No locations found
ar: لم يتم العثور على مواقع

source: Select Location
ar: اختر الموقع

# authRequired
source: Authentication Required
ar: مطلوب مصادقة

# biometricAuth
source: Use biometric authentication
ar: استخدم المصادقة البيومترية

# passwordAuth
source: Enter your password
ar: أدخل كلمة المرور

source: Location Picker
ar: منتقي الموقع

source: Confirm Location
ar: تأكيد الموقع

# locationUpdated
source: Location updated successfully
ar: تم تحديث الموقع بنجاح

# locationAdded
source: Location added successfully
ar: تم إضافة الموقع بنجاح

# locationDeleted
source: Location deleted successfully
ar: تم حذف الموقع بنجاح

source: Location error
ar: خطأ في الموقع

# emptyLocationList
source: No locations added yet
ar: لم تتم إضافة مواقع بعد

# addLocationButton
source: Add New Location
ar: إضافة موقع جديد

source: Edit Location
ar: تعديل الموقع

# confirmDeleteLocation
source: Are you sure you want to delete this location?
ar: هل أنت متأكد من حذف هذا الموقع؟

# confirmDeleteBranch
source: Are you sure you want to delete this branch?
ar: هل أنت متأكد من حذف هذا الفرع؟

# branchDeleted
source: Branch deleted successfully
ar: تم حذف الفرع بنجاح

# branchUpdated
source: Branch updated successfully
ar: تم تحديث الفرع بنجاح

# branchAdded
source: Branch added successfully
ar: تم إضافة الفرع بنجاح

# locationPermissionRequired
source: Location permission is required to use this feature
ar: مطلوب إذن الموقع لاستخدام هذه الميزة

# enableLocationServices
source: Please enable location services to continue
ar: يرجى تمكين خدمات الموقع للمتابعة

# locationAccessRequired
source: Location access is required for this feature to work properly
ar: مطلوب الوصول إلى الموقع لعمل هذه الميزة بشكل صحيح

source: Failed to load posts
ar: فشل في تحميل المنشورات

source: Failed to create post
ar: فشل في إنشاء المنشور

source: Failed to load user posts
ar: فشل في تحميل منشورات المستخدم

source: Failed to load saved posts
ar: فشل في تحميل المنشورات المحفوظة

source: Failed to load profile
ar: فشل في تحميل الملف الشخصي

source: Failed to load comments
ar: فشل في تحميل التعليقات

source: Failed to load replies
ar: فشل في تحميل الردود

source: Failed to load likes
ar: فشل في تحميل الإعجابات

source: Failed to load users
ar: فشل في تحميل المستخدمين

source: Failed to load vendors
ar: فشل في تحميل البائعين

source: Failed to load products
ar: فشل في تحميل المنتجات

source: Failed to follow user
ar: فشل في متابعة المستخدم

source: Failed to unfollow user
ar: فشل في إلغاء متابعة المستخدم

source: Failed to like post
ar: فشل في الإعجاب بالمنشور

source: Failed to unlike post
ar: فشل في إلغاء الإعجاب بالمنشور

source: Failed to like comment
ar: فشل في الإعجاب بالتعليق

source: Failed to unlike comment
ar: فشل في إلغاء الإعجاب بالتعليق

source: Failed to add comment
ar: فشل في إضافة التعليق

source: Failed to add reply
ar: فشل في إضافة الرد

source: Failed to delete comment
ar: فشل في حذف التعليق

source: Failed to delete reply
ar: فشل في حذف الرد

source: Failed to save post
ar: فشل في حفظ المنشور

source: Post created successfully
ar: تم إنشاء المنشور بنجاح

source: Post saved successfully
ar: تم حفظ المنشور بنجاح

source: Post unsaved successfully
ar: تم إلغاء حفظ المنشور بنجاح

source: User followed successfully
ar: تم متابعة المستخدم بنجاح

source: User unfollowed successfully
ar: تم إلغاء متابعة المستخدم بنجاح

source: Comment added successfully
ar: تم إضافة التعليق بنجاح

source: Reply added successfully
ar: تم إضافة الرد بنجاح

source: Comment deleted successfully
ar: تم حذف التعليق بنجاح

source: Reply deleted successfully
ar: تم حذف الرد بنجاح

source: Uploading
ar: جاري الرفع

source: No users found
ar: لم يتم العثور على مستخدمين

source: No vendors found
ar: لم يتم العثور على بائعين

source: No products found
ar: لم يتم العثور على منتجات

source: No comments found
ar: لم يتم العثور على تعليقات

source: No replies found
ar: لم يتم العثور على ردود

source: No likes found
ar: لم يتم العثور على إعجابات

source: Search for users
ar: البحث عن مستخدمين

source: Search for vendors
ar: البحث عن بائعين

source: Search for products
ar: البحث عن منتجات

source: Select Vendor
ar: اختر البائع

source: Select Product
ar: اختر المنتج

# writeComment
source: Write a comment
ar: اكتب تعليق

# writeReply
source: Write a reply
ar: اكتب رد

# confirmDeleteComment
source: Are you sure you want to delete this comment?
ar: هل أنت متأكد من حذف هذا التعليق؟

# confirmDeleteReply
source: Are you sure you want to delete this reply?
ar: هل أنت متأكد من حذف هذا الرد؟

source: Posts
ar: المنشورات

source: Loading profile...
ar: جاري تحميل الملف الشخصي...

source: Loading posts...
ar: جاري تحميل المنشورات...

source: Loading comments...
ar: جاري تحميل التعليقات...

source: Loading replies...
ar: جاري تحميل الردود...

source: Loading likes...
ar: جاري تحميل الإعجابات...

source: Loading users...
ar: جاري تحميل المستخدمين...

source: Loading vendors...
ar: جاري تحميل البائعين...

source: Loading products...
ar: جاري تحميل المنتجات...

source: Refresh
ar: تحديث

source: Upload Progress
ar: تقدم الرفع

# optimisticUpdate
source: Updating...
ar: جاري التحديث...

source: Temporary state
ar: حالة مؤقتة

source: Post deleted
ar: تم حذف المنشور

source: Edit Post
ar: تعديل المنشور

source: Delete Post
ar: حذف المنشور

# confirmDeletePost
source: Are you sure you want to delete this post? This action cannot be undone.
ar: هل أنت متأكد من حذف هذا المنشور؟ لا يمكن التراجع عن هذا الإجراء.

source: Delete
ar: حذف

source: Share Post
ar: مشاركة المنشور

# shareFunctionality
source: Share functionality would be implemented here
ar: سيتم تنفيذ وظيفة المشاركة هنا

source: Your post
ar: منشورك

source: You
ar: أنت

source: Comment added
ar: تمت إضافة التعليق

source: Reply added
ar: تمت إضافة الرد

source: Comment deleted
ar: تم حذف التعليق

source: Reply deleted
ar: تم حذف الرد

source: No user posts
ar: لا توجد منشورات للمستخدم

# shimmerLoading
source: Loading...
ar: جاري التحميل...

source: No data available
ar: لا توجد بيانات متاحة

source: Error loading data
ar: خطأ في تحميل البيانات

source: Story
ar: قصة

source: Add Story
ar: إضافة قصة

source: No stories available
ar: لا توجد قصص متاحة

source: Loading story...
ar: جاري تحميل القصة...

source: Story added
ar: تمت إضافة القصة

source: Failed to add story
ar: فشل في إضافة القصة

source: Story deleted
ar: تم حذف القصة

source: Failed to delete story
ar: فشل في حذف القصة

source: View Story
ar: عرض القصة

source: Story viewed
ar: تم عرض القصة

source: Failed to view story
ar: فشل في عرض القصة

source: Story expired
ar: انتهت صلاحية القصة

source: Uploading story...
ar: جاري رفع القصة...

source: Story upload progress
ar: تقدم رفع القصة

source: Story upload complete
ar: اكتمل رفع القصة

source: Story upload failed
ar: فشل رفع القصة

source: Add photo to story
ar: إضافة صورة إلى القصة

source: Add video to story
ar: إضافة فيديو إلى القصة

source: Failed to load notifications
ar: فشل في تحميل الإشعارات

source: Failed to mark notification as read
ar: فشل في تحديد الإشعار كمقروء

source: Failed to mark all notifications as read
ar: فشل في تحديد جميع الإشعارات كمقروءة

source: Notification marked as read
ar: تم تحديد الإشعار كمقروء

source: All notifications marked as read
ar: تم تحديد جميع الإشعارات كمقروءة

# notificationsEmpty
source: You're all caught up!
ar: لقد اطلعت على كل شيء!

# notificationsEmptySubtitle
source: No notifications yet
ar: لا توجد إشعارات بعد

source: Loading notifications...
ar: جاري تحميل الإشعارات...

source: Refresh notifications
ar: تحديث الإشعارات

source: Mark all as read
ar: تحديد الكل كمقروء

source: Notification settings
ar: إعدادات الإشعارات

source: Notification preferences
ar: تفضيلات الإشعارات

source: Notification history
ar: سجل الإشعارات

source: Clear all notifications
ar: مسح جميع الإشعارات

# confirmClearAllNotifications
source: Are you sure you want to clear all notifications?
ar: هل أنت متأكد من مسح جميع الإشعارات؟

source: Notifications cleared
ar: تم مسح الإشعارات
